app/views/main/index.html.erb

SELECT "users".* FROM "users"
---

<% for user in User.all %>