app/views/main/profile.html.erb

SELECT "users".* FROM "users" WHERE "users"."username" = '2' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
<% if User.exists?(params[:username]) %>
	<h1>Hi, I'm <%= User.find(params[:username]).username %></h1>