app/views/partials/_onlineusers.html.erb

SELECT "users".* FROM "users" WHERE (last_request_at > '2011-06-05 16:12:16.180000') ORDER BY last_request_at DESC LIMIT 6
---
				<h4>Online Users</h4>
				<% users = User.where(["last_request_at > ?", 5.minutes.ago]).order("last_request_at DESC").limit(6) %>