app/views/games/show.html.erb

SELECT "comments".* FROM "comments" WHERE ("comments".commentable_id = 1 AND "comments".commentable_type = 'Game') ORDER BY created_at DESC
SELECT COUNT(*) FROM "comments" WHERE ("comments".commentable_id = 1 AND "comments".commentable_type = 'Game')
---
				<section class="meta">
				<p>Author: <a href="http://www.jabz.info/contact/jonas-jared-jacek/"><%= @game.author %></a> | Date: <%=@game.created_at.strftime("%a %e, %b %Y") %> | Comments: <a href="#comments"><%=@game.comments.count %></a></p>