app/controllers/games_controller.rb

  def show
    @game = Game.find(params[:id])
		@comments = @game.comments.recent.limit(10).all
---
SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1
SELECT "comments".* FROM "comments" WHERE ("comments".commentable_id = 2 AND "comments".commentable_type = 'Game') ORDER BY created_at ASC, created_at DESC LIMIT 10

  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("name", "smallname", "statement", "inputdetails", "outputdetails", "requirements", "author", "created_at", "updated_at") VALUES ('Connect 4', 'connect4', 'You are playing connect 4.', 'Opponents move', 'Your move', '1 sec per game', 'Christos', '2011-06-05 10:35:35.786949', '2011-06-05 10:35:35.786949')

  def comment
    @game = Game.find(params[:id])
    @comment = Comment.new(params[:comment])
    @comment.user = current_user
    respond_to do |format|
      if @comment.save
      	@game.comments << @comment
        format.html { redirect_to(@game, :notice => 'Comment was added.') }
        format.xml  { render :xml => @comment, :status => :created, :location => @game }
      else
      	puts @comment.errors.inspect
        format.html { redirect_to(@game, :alert => @comment.errors.map {|x,y| x.to_s.camelize + " " + y}.join(' / ') ) }
---
SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1
INSERT INTO "comments" ("title", "comment", "commentable_id", "commentable_type", "user_id", "created_at", "updated_at") VALUES ('My comment', 'Just another comment my friend', NULL, NULL, NULL, '2011-06-06 07:40:55.239009', '2011-06-06 07:40:55.239009')
SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1

  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])
---
SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1
UPDATE "games" SET "statement" = '<p><cite><a href="http://en.wikipedia.org/wiki/Connect_Four">Wikipedia</a> wrote:</cite></p>