app/controllers/main_controller.rb

	def profile
    @user = User.find(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'tester' LIMIT 1