app/controllers/sources_controller.rb

	def show
    @source = Source.find(params[:id])
---
SELECT "sources".* FROM "sources" WHERE "sources"."id" = 2 LIMIT 1

  def create
  	@source = Source.new(params[:source])
  	@source.user = current_user
  	@source.save
---
INSERT INTO "sources" ("user_id", "game_id", "language", "code", "active", "result", "created_at", "updated_at") VALUES (9, 1, 'c', 'htht', 'f', NULL, '2011-06-06 15:43:34.854712', '2011-06-06 15:43:34.854712')